Tekla.Structures.Filtering.StringOperatorType
The string operator type defines the operators between two string filter expressions.

Tekla.Structures.Filtering.StringOperatorType.IS_EQUAL
The "is equal" operator.

Tekla.Structures.Filtering.StringOperatorType.IS_NOT_EQUAL
The "is not equal" operator.

Tekla.Structures.Filtering.StringOperatorType.CONTAINS
The "contains" string operator.

Tekla.Structures.Filtering.StringOperatorType.NOT_CONTAINS
The "not contains" string operator.

Tekla.Structures.Filtering.StringOperatorType.STARTS_WITH
The "starts with" string operator.

Tekla.Structures.Filtering.StringOperatorType.NOT_STARTS_WITH
The "not starts with" string operator.

Tekla.Structures.Filtering.StringOperatorType.ENDS_WITH
The "ends with" string operator.

Tekla.Structures.Filtering.StringOperatorType.NOT_ENDS_WITH
The "not ends with" string operator.